espressif/esp-idf/components/soc/esp32h4/register/soc/apb_saradc_struct.h
/** Type of saradc_int_st register
 *  digital saradc int register
 */
typedef union {
    struct {
        uint32_t reserved_0:25;
        /** saradc_apb_saradc_tsens_int_st : RO; bitpos: [25]; default: 0;
         *  saradc tsens  interrupt state
         */
        uint32_t saradc_apb_saradc_tsens_int_st:1;
        /** saradc_apb_saradc_thres1_low_int_st : RO; bitpos: [26]; default: 0;
         *  saradc thres1 low  interrupt state
         */
        uint32_t saradc_apb_saradc_thres1_low_int_st:1;
        /** saradc_apb_saradc_thres0_low_int_st : RO; bitpos: [27]; default: 0;
         *  saradc thres0 low interrupt state
         */
        uint32_t saradc_apb_saradc_thres0_low_int_st:1;
        /** saradc_apb_saradc_thres1_high_int_st : RO; bitpos: [28]; default: 0;
         *  saradc thres1 high interrupt state
         */
        uint32_t saradc_apb_saradc_thres1_high_int_st:1;
        /** saradc_apb_saradc_thres0_high_int_st : RO; bitpos: [29]; default: 0;
         *  saradc thres0 high interrupt state
         */
        uint32_t saradc_apb_saradc_thres0_high_int_st:1;
        /** saradc_apb_saradc2_done_int_st : RO; bitpos: [30]; default: 0;
         *  saradc2 done interrupt state
         */
        uint32_t saradc_apb_saradc2_done_int_st:1;
        /** saradc_apb_saradc1_done_int_st : RO; bitpos: [31]; default: 0;
         *  saradc1 done interrupt state
         */
        uint32_t saradc_apb_saradc1_done_int_st:1;
    };
    uint32_t val;
} apb_saradc_int_st_reg_t;

/** Type of saradc_int_clr register
 *  digital saradc int register
 */
typedef union {
    struct {
        uint32_t reserved_0:25;
        /** saradc_apb_saradc_tsens_int_clr : WT; bitpos: [25]; default: 0;
         *  saradc tsens  interrupt clear
         */
        uint32_t saradc_apb_saradc_tsens_int_clr:1;
        /** saradc_apb_saradc_thres1_low_int_clr : WT; bitpos: [26]; default: 0;
         *  saradc thres1 low  interrupt clear
         */
        uint32_t saradc_apb_saradc_thres1_low_int_clr:1;
        /** saradc_apb_saradc_thres0_low_int_clr : WT; bitpos: [27]; default: 0;
         *  saradc thres0 low interrupt clear
         */
        uint32_t saradc_apb_saradc_thres0_low_int_clr:1;
        /** saradc_apb_saradc_thres1_high_int_clr : WT; bitpos: [28]; default: 0;
         *  saradc thres1 high interrupt clear
         */
        uint32_t saradc_apb_saradc_thres1_high_int_clr:1;
        /** saradc_apb_saradc_thres0_high_int_clr : WT; bitpos: [29]; default: 0;
         *  saradc thres0 high interrupt clear
         */
        uint32_t saradc_apb_saradc_thres0_high_int_clr:1;
        /** saradc_apb_saradc2_done_int_clr : WT; bitpos: [30]; default: 0;
         *  saradc2 done interrupt clear
         */
        uint32_t saradc_apb_saradc2_done_int_clr:1;
        /** saradc_apb_saradc1_done_int_clr : WT; bitpos: [31]; default: 0;
         *  saradc1 done interrupt clear
         */
        uint32_t saradc_apb_saradc1_done_int_clr:1;
    };
    uint32_t val;
} apb_saradc_int_clr_reg_t;

/** Type of saradc_dma_conf register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_apb_adc_eof_num : R/W; bitpos: [15:0]; default: 255;
         *  the dma_in_suc_eof gen when sample cnt = spi_eof_num
         */
        uint32_t saradc_apb_adc_eof_num:16;
        uint32_t reserved_16:14;
        /** saradc_apb_adc_reset_fsm : R/W; bitpos: [30]; default: 0;
         *  reset_apb_adc_state
         */
        uint32_t saradc_apb_adc_reset_fsm:1;
        /** saradc_apb_adc_trans : R/W; bitpos: [31]; default: 0;
         *  enable apb_adc use spi_dma
         */
        uint32_t saradc_apb_adc_trans:1;
    };
    uint32_t val;
} apb_saradc_dma_conf_reg_t;

/** Type of saradc_clkm_conf register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_clkm_div_num : R/W; bitpos: [7:0]; default: 4;
         *  Integral I2S clock divider value
         */
        uint32_t saradc_clkm_div_num:8;
        /** saradc_clkm_div_b : R/W; bitpos: [13:8]; default: 0;
         *  Fractional clock divider numerator value
         */
        uint32_t saradc_clkm_div_b:6;
        /** saradc_clkm_div_a : R/W; bitpos: [19:14]; default: 0;
         *  Fractional clock divider denominator value
         */
        uint32_t saradc_clkm_div_a:6;
        /** saradc_clk_en : R/W; bitpos: [20]; default: 0;
         *  reg clk en
         */
        uint32_t saradc_clk_en:1;
        /** saradc_clk_sel : R/W; bitpos: [22:21]; default: 0;
         *  Set this bit to enable clk_apll
         */
        uint32_t saradc_clk_sel:2;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} apb_saradc_clkm_conf_reg_t;

/** Type of saradc_apb_tsens_ctrl register
 *  digital tsens configure register
 */
typedef union {
    struct {
        /** saradc_tsens_out : RO; bitpos: [7:0]; default: 128;
         *  temperature sensor data out
         */
        uint32_t saradc_tsens_out:8;
        uint32_t reserved_8:5;
        /** saradc_tsens_in_inv : R/W; bitpos: [13]; default: 0;
         *  invert temperature sensor data
         */
        uint32_t saradc_tsens_in_inv:1;
        /** saradc_tsens_clk_div : R/W; bitpos: [21:14]; default: 6;
         *  temperature sensor clock divider
         */
        uint32_t saradc_tsens_clk_div:8;
        /** saradc_tsens_pu : R/W; bitpos: [22]; default: 0;
         *  temperature sensor power up
         */
        uint32_t saradc_tsens_pu:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} apb_saradc_apb_tsens_ctrl_reg_t;

/** Type of saradc_tsens_ctrl2 register
 *  digital tsens configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:15;
        /** saradc_tsens_clk_sel : R/W; bitpos: [15]; default: 0;
         *  tsens clk select
         */
        uint32_t saradc_tsens_clk_sel:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} apb_saradc_tsens_ctrl2_reg_t;

/** Type of saradc_cali register
 *  digital saradc configure register
 */
typedef union {
    struct {
        /** saradc_apb_saradc_cali_cfg : R/W; bitpos: [16:0]; default: 32768;
         *  saradc cali factor
         */
        uint32_t saradc_apb_saradc_cali_cfg:17;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} apb_saradc_cali_reg_t;

/** Type of tsens_wake register
 *  digital tsens configure register
 */
typedef union {
    struct {
        /** saradc_wakeup_th_low : R/W; bitpos: [7:0]; default: 0;
         *  reg_wakeup_th_low
         */
        uint32_t saradc_wakeup_th_low:8;
        /** saradc_wakeup_th_high : R/W; bitpos: [15:8]; default: 255;
         *  reg_wakeup_th_high
         */
        uint32_t saradc_wakeup_th_high:8;
        /** saradc_wakeup_over_upper_th : RO; bitpos: [16]; default: 0;
         *  reg_wakeup_over_upper_th
         */
        uint32_t saradc_wakeup_over_upper_th:1;
        /** saradc_wakeup_mode : R/W; bitpos: [17]; default: 0;
         *  reg_wakeup_mode
         */
        uint32_t saradc_wakeup_mode:1;
        /** saradc_wakeup_en : R/W; bitpos: [18]; default: 0;
         *  reg_wakeup_en
         */
        uint32_t saradc_wakeup_en:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} apb_tsens_wake_reg_t;

/** Type of tsens_sample register
 *  digital tsens configure register
 */
typedef union {
    struct {
        /** saradc_tsens_sample_rate : R/W; bitpos: [15:0]; default: 20;
         *  HW sample rate
         */
        uint32_t saradc_tsens_sample_rate:16;
        /** saradc_tsens_sample_en : R/W; bitpos: [16]; default: 0;
         *  HW sample en
         */
        uint32_t saradc_tsens_sample_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} apb_tsens_sample_reg_t;

/** Type of saradc_ctrl_date register
 *  version
 */
typedef union {
    struct {
        /** saradc_date : R/W; bitpos: [31:0]; default: 35676736;
         *  version
         */
        uint32_t saradc_date:32;
    };
    uint32_t val;
} apb_saradc_ctrl_date_reg_t;


